# NExteriorSurfaceArea Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
MassLevelData..::..NExteriorSurfaceArea Property
MassLevelData Class See Also
---
The exterior surface area of the volume of the mass between the level of this MassLevelData (Mass Floor) to the next in the mass.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public double NExteriorSurfaceArea { get; }
```

Visual Basic
---
```text
Public ReadOnly Property NExteriorSurfaceArea As Double
	Get
```

Visual C++
---
```text
public:
property double NExteriorSurfaceArea {
	double get ();
}
```

# See Also
MassLevelData Class
Autodesk.Revit.DB.Analysis Namespace